# Поработайте с переменными, создайте несколько, выведите на экран.
# Запросите у пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран.

# Создание переменных
str_var = "Строковая переменная"
int_var = 15
float_var = 4.97

# Вывод созданных переменных на экран
print(str_var)
print(int_var)
print(float_var)

# Запрос у пользователя нескольких чисел
num_1 = int(input('Введите первое целое число: '))
num_2 = int(input('Введите второе целое число: '))
num_3 = int(input('Введите третье целое число: '))

# Запрос у пользователя нескольких строк:
str_1 = input('Введите первую строку: ')
str_2 = input('Введите вторую строку: ')
str_3 = input('Введите третью строку: ')

# вывод сохраненных данных:
print("Введённые числа:", num_1, num_2, num_3)
print("Введённые строки:", str_1, str_2, str_3)